mgo-tec/ESP32_SD_SSD1331_Gadgets/src/ESP32_SD_SSD1331_Gadgets.cpp
//*********** 16x16自作フォント時刻スクロール **********************
void ESP32_SD_SSD1331_Gadgets::MyFont16x16ClockScroll(char VorH, uint8_t ForB, char t_chr, char *Lt_chr, bool *fnt_read, uint8_t *scl_cnt, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t (&fnt)[2][16]){
  uint8_t y1 = y0 + 15;
  uint8_t Hscl_cnt = 16;

  if(t_chr != *Lt_chr){
    if(*fnt_read == true && *scl_cnt == 0){
      if(t_chr == ' '){ //時間表示の十の位が空白の場合、フォントにゼロを代入
        for(int i=0; i<16; i++){
          for(int j= 0; j<16; j++){
            fnt[i][j] = 0;
          }
        }
      }else{
        uint8_t num = t_chr - 0x30;
        ESP32_SD_SSD1331_Gadgets::MyFont_SD_Read(_MyF, 2, num, fnt);
      }
      *fnt_read = false;
    }
    if(VorH == 'V'){
      _ssd1331.Time_Copy_V_Scroll(ForB, 2, fnt, scl_cnt, x0, y0, x0+15, y1, red, green, blue);
    }else if(VorH == 'H'){
      _ssd1331.Time_Copy_H_Scroll(ForB, 2, fnt, scl_cnt, x0, y0, x0+15, y1, red, green, blue);
    }
  }

  if(*scl_cnt == Hscl_cnt){
    *Lt_chr = t_chr;
    *scl_cnt = 0;
    *fnt_read = true;
  }
}
//***************************
void ESP32_SD_SSD1331_Gadgets::MyFont_SD_Read(File F, uint8_t ZorH, uint8_t num, uint8_t (&buf)[2][16]){
  F.seek(num * (16 * ZorH));
  F.read(buf[0], 16);
  F.read(buf[1], 16);
}
//***************************
void ESP32_SD_SSD1331_Gadgets::Scroll_1_line(uint8_t y, uint8_t num, uint8_t red, uint8_t green, uint8_t blue, uint16_t interval, uint8_t sjis_code[], uint16_t length, bool *WebGet){
  if((xTaskGetTickCount() - _xLastTime[num]) > interval){
    if(*WebGet){
      _SJ_cnt[num] = 0;
      _scl_cnt[num] = 0;
      _Zen_or_Han_cnt[num] = 0;
      _fnt_read_ok[num] = true;
      
      for(int i=0; i<16; i++){
        _Font_buf[num][0][i] = 0;
        _Font_buf[num][1][i] = 0;
      }
      
      *WebGet = false;
    }
    if(_fnt_read_ok[num] == true){
      _zen_or_han[num] = _SFR.Sjis_inc_FntRead(sjis_code, length, &_SJ_cnt[num], _Font_buf[num]);
    }
    _fnt_read_ok[num] = _ssd1331.Scroller_8x16_RtoL4line(y, num, _zen_or_han[num], &_scl_cnt[num], &_Zen_or_Han_cnt[num], _Font_buf[num], red, green, blue);
    _xLastTime[num] = xTaskGetTickCount();
  }
}
//******************** root CA SD card Get **********************
void ESP32_SD_SSD1331_Gadgets::Root_CA_SDcard_Read(const char *filename, char *Root_CA){
    //SD.begin(CS_SD, SPI, 24000000, "/sd");

    File file = SD.open(filename, FILE_READ);
    if (!file) {
      Serial.print(filename);
      Serial.print(" File not found");
      return;
    }else{
      Serial.print(filename);
      Serial.println(" File read OK!");
    }
    uint16_t i = 0;
    while(file.available()){
      Root_CA[i] = file.read();
      i++;
    }
    Root_CA[i] = '\0';
    file.close();
}

//*************気象庁天気予報用****************************
void ESP32_SD_SSD1331_Gadgets::dispJapanWeatherMyFont( uint8_t y0, String weather_str )
{
  uint8_t today_fnum[3] = {}, tomorrow_fnum[3] = {};
  uint8_t today_col[3][3] ={}, tomorrow_col[3][3] = {};
  uint8_t weather_fnt_buf[2][2][16] = {};
  String weather_code_from_key = "weatherCodes\":[\"";

  uint8_t from1 = weather_str.indexOf(weather_code_from_key, 0) + weather_code_from_key.length();
  uint8_t to1 = from1 + 3;
  uint8_t from2 = to1 + 3;
  uint8_t to2 = from2 + 3;
  String today_w_code_str = weather_str.substring(from1, to1);
  String tomorrow_w_code_str = weather_str.substring(from2, to2);
  uint16_t today_weather_code = atoi(today_w_code_str.c_str());
  uint16_t tomorrow_weather_code = atoi(tomorrow_w_code_str.c_str());
  //Serial.print(F("Today Weather Coode_str = ")); Serial.println(today_w_code_str);
  //Serial.print(F("Tomorrow Weather Code_str = ")); Serial.println(tomorrow_w_code_str);
  Serial.print(F("Today Weather Coode = ")); Serial.println(today_weather_code);
  Serial.print(F("Tomorrow Weather Code = ")); Serial.println(tomorrow_weather_code);

  ESP32_SD_SSD1331_Gadgets::JapanWeatherFontNum(today_weather_code, 0, hour(), today_fnum, today_col);
  ESP32_SD_SSD1331_Gadgets::JapanWeatherFontNum(tomorrow_weather_code, 1, hour(), tomorrow_fnum, tomorrow_col);

  //なぜか"Cannot file.seek in SD file system" というメッセージが出た
  for(int i=0; i<3; i++){
    if(today_fnum[i] != 0){
      //Serial.print("today_fnum=");
      //Serial.println(today_fnum[i]);
      ESP32_SD_SSD1331_Gadgets::MyFont_SD_Read(_MyF, 2, today_fnum[i], weather_fnt_buf[0]);
    }
    //weather_font.x0 = 64 + i * 16 * weather_font.Xsize;
    //weather_font.red = today_col[i][0], weather_font.green = today_col[i][1], weather_font.blue = today_col[i][2];
    //weather_font.bg_red = 0, weather_font.bg_green = 0, weather_font.bg_blue = 0; 
    //LCD.display8x16Font(weather_font, 2, weather_fnt_buf[0]);
    _ssd1331.SSD1331_8x16_Font_DisplayOut(2, i*16, y0, today_col[i][0], today_col[i][1], today_col[i][2], weather_fnt_buf[0]);
    delay(1);
  }

  for(int i=0; i<3; i++){
    if(tomorrow_fnum[i] != 0){
      //Serial.print("tomorrow_fnum=");
      //Serial.println(tomorrow_fnum[i]);
      ESP32_SD_SSD1331_Gadgets::MyFont_SD_Read(_MyF, 2, tomorrow_fnum[i], weather_fnt_buf[1]);
    }
    //weather_font.x0 = 224 + i * 16 * weather_font.Xsize;
    //weather_font.red = tomorrow_col[i][0], weather_font.green = tomorrow_col[i][1], weather_font.blue = tomorrow_col[i][2];
    //LCD.display8x16Font( weather_font, 2, weather_fnt_buf[1] );
    _ssd1331.SSD1331_8x16_Font_DisplayOut(2, 48+i*16, y0, tomorrow_col[i][0], tomorrow_col[i][1], tomorrow_col[i][2], weather_fnt_buf[1]);
    delay(1);
  }
}
//***************** 気象庁 Weather MyFont Number get *************************************************
void ESP32_SD_SSD1331_Gadgets::JapanWeatherFontNum(
  uint16_t weather_code,
  uint8_t wDay,
  uint8_t Htime,
  uint8_t (&Fnum)[3],
  uint8_t (&col)[3][3])
{
  uint8_t Sunny_red = 31, Sunny_green = 40, Sunny_blue = 0;
  uint8_t Cloudy_red = 29, Cloudy_green = 60, Cloudy_blue = 29;
  uint8_t Rain_red = 0, Rain_green = 0, Rain_blue = 31;
  uint8_t Snow_red = 31, Snow_green = 63, Snow_blue = 31;
  uint8_t Thunder_red = 31, Thunder_green = 63, Thunder_blue = 0;

