mgo-tec/ESP32_SD_SSD1331_Gadgets/src/ESP32_SD_SSD1331_Gadgets.cpp
  col[1][0] = 31; col[1][1] = 63; col[1][2] = 31; //矢印

  uint8_t sunny_fnt_num;
  if((wDay == 0) && (Htime >= 15)){ //wDay = 0 今日、wDay = 1 明日
    Sunny_red =  Thunder_red, Sunny_green = Thunder_green, Sunny_blue = Thunder_blue;
    sunny_fnt_num = 26;
  }else{
    sunny_fnt_num = 20;
  }

  uint8_t cloudy_fnt_num = 21;
  uint8_t rain_fnt_num = 22;
  uint8_t snow_fnt_num = 24;
  uint8_t storm_fnt_num = 23;
  //uint8_t thunder_fnt_num = 25;


  switch(weather_code){
    //--------Clear（晴れ）-----------------
    case 100:
    case 123:
    case 124:
    case 130:
    case 131:
      //Serial.println("晴れ");
      Fnum[0] = 0;
      col[1][0] =  Sunny_red; col[1][1] = Sunny_green; col[1][2] = Sunny_blue;
      Fnum[1] = sunny_fnt_num; //縦棒、または矢印
      Fnum[2] = 0;
      break;

    //--------晴れ時々（一時）曇り----------------
    case 101:
    case 132:
      //Serial.println("晴れ時々曇り");
      col[0][0] =  Sunny_red; col[0][1] = Sunny_green; col[0][2] = Sunny_blue;
      Fnum[0] = sunny_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Cloudy_red; col[2][1] = Cloudy_green; col[2][2] = Cloudy_blue;
      Fnum[2] = cloudy_fnt_num;
      break;

    //--------晴れ時々（一時）雨----------------
    case 102:
    case 103:
    case 106:
    case 107:
    case 108:
    case 120:
    case 121:
    case 140:
      //Serial.println("晴れ時々雨");
      col[0][0] =  Sunny_red; col[0][1] = Sunny_green; col[0][2] = Sunny_blue;
      Fnum[0] = sunny_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Rain_red; col[2][1] = Rain_green; col[2][2] = Rain_blue;
      Fnum[2] = rain_fnt_num;
      break;

    //--------晴れ時々（一時）雪----------------
    case 104:
    case 105:
    case 160:
    case 170:
      //Serial.println("晴れ時々雪");
      col[0][0] =  Sunny_red; col[0][1] = Sunny_green; col[0][2] = Sunny_blue;
      Fnum[0] = sunny_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Snow_red; col[2][1] = Snow_green; col[2][2] = Snow_blue;
      Fnum[2] = snow_fnt_num;
      break;

    //--------晴れ後曇り----------------
    case 110:
    case 111:
      //Serial.println("晴れ後曇り");
      col[0][0] =  Sunny_red; col[0][1] = Sunny_green; col[0][2] = Sunny_blue;
      Fnum[0] = sunny_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Cloudy_red; col[2][1] = Cloudy_green; col[2][2] = Cloudy_blue;
      Fnum[2] = cloudy_fnt_num;
      break;

    //--------晴れ後雨----------------
    case 112:
    case 113:
    case 114:
    case 118:
    case 119:
    case 122:
    case 125:
    case 126:
    case 127:
    case 128:
      //Serial.println("晴れ後雨");
      col[0][0] =  Sunny_red; col[0][1] = Sunny_green; col[0][2] = Sunny_blue;
      Fnum[0] = sunny_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Rain_red; col[2][1] = Rain_green; col[2][2] = Rain_blue;
      Fnum[2] = rain_fnt_num;
      break;

    //--------晴れ後雪----------------
    case 115:
    case 116:
    case 117:
    case 181:
      //Serial.println("晴れ後雪");
      col[0][0] =  Sunny_red; col[0][1] = Sunny_green; col[0][2] = Sunny_blue;
      Fnum[0] = sunny_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Snow_red; col[2][1] = Snow_green; col[2][2] = Snow_blue;
      Fnum[2] = snow_fnt_num;
      break;
    
    //--------曇り-----------------
    case 200:
    case 209:
    case 231:
      //Serial.println("曇り");
      Fnum[0] = 0;
      col[1][0] =  Cloudy_red; col[1][1] = Cloudy_green; col[1][2] = Cloudy_blue;
      Fnum[1] = cloudy_fnt_num; //縦棒、または矢印
      Fnum[2] = 0;
      break;

    //--------曇り時々晴れ-----------------
    case 201:
    case 223:
      //Serial.println("曇り時々晴れ");
      col[0][0] =  Cloudy_red; col[0][1] = Cloudy_green; col[0][2] = Cloudy_blue;
      Fnum[0] = cloudy_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Sunny_red; col[2][1] = Sunny_green; col[2][2] = Sunny_blue;
      Fnum[2] = sunny_fnt_num;
      break;
    
    //--------曇り時々雨-----------------
    case 202:
    case 203:
    case 206:
    case 207:
    case 208:
    case 220:
    case 221:
    case 240:
      //Serial.println("曇り時々雨");
      col[0][0] =  Cloudy_red; col[0][1] = Cloudy_green; col[0][2] = Cloudy_blue;
      Fnum[0] = cloudy_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Rain_red; col[2][1] = Rain_green; col[2][2] = Rain_blue;
      Fnum[2] = rain_fnt_num;
      break;
    
    //--------曇り一時雪-----------------
    case 204:
    case 205:
    case 250:
    case 260:
    case 270:
      //Serial.println("曇り一時雪");
      col[0][0] =  Cloudy_red; col[0][1] = Cloudy_green; col[0][2] = Cloudy_blue;
      Fnum[0] = cloudy_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Snow_red; col[2][1] = Snow_green; col[2][2] = Snow_blue;
      Fnum[2] = snow_fnt_num;
      break;

    //--------曇り後晴れ-----------------
    case 210:
    case 211:
      //Serial.println("曇り後晴れ");
      col[0][0] =  Cloudy_red; col[0][1] = Cloudy_green; col[0][2] = Cloudy_blue;
      Fnum[0] = cloudy_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Sunny_red; col[2][1] = Sunny_green; col[2][2] = Sunny_blue;
      Fnum[2] = sunny_fnt_num;
      break;

    //--------曇り後雨-----------------
    case 212:
    case 213:
    case 214:
    case 218:
    case 219:
    case 222:
    case 224:
    case 225:
    case 226:
      //Serial.println("曇り後雨");
      col[0][0] =  Cloudy_red; col[0][1] = Cloudy_green; col[0][2] = Cloudy_blue;
      Fnum[0] = cloudy_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Rain_red; col[2][1] = Rain_green; col[2][2] = Rain_blue;
      Fnum[2] = rain_fnt_num;
      break;
    
    //--------曇り後雪-----------------
    case 215:
    case 216:
    case 217:
    case 228:
    case 229:
    case 230:
    case 281:
      //Serial.println("曇り後雪");
      col[0][0] =  Cloudy_red; col[0][1] = Cloudy_green; col[0][2] = Cloudy_blue;
      Fnum[0] = cloudy_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Snow_red; col[2][1] = Snow_green; col[2][2] = Snow_blue;
      Fnum[2] = snow_fnt_num;
      break;
    
    //--------雨-----------------
    case 300:
    case 304:
    case 306:
    case 328:
    case 329:
    case 350:
      //Serial.println("雨");
      Fnum[0] = 0;
      col[1][0] =  Rain_red; col[1][1] = Rain_green; col[1][2] = Rain_blue;
      Fnum[1] = rain_fnt_num; //縦棒、または矢印
      Fnum[2] = 0;
      break;

    //--------雨時々晴れ-----------------
    case 301:
      //Serial.println("雨時々晴れ");
      col[0][0] =  Rain_red; col[0][1] = Rain_green; col[0][2] = Rain_blue;
      Fnum[0] = rain_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Sunny_red; col[2][1] = Sunny_green; col[2][2] = Sunny_blue;
      Fnum[2] = sunny_fnt_num;
      break;
    
    //--------雨時々曇り-----------------
    case 302:
      //Serial.println("雨時々曇り");
      col[0][0] =  Rain_red; col[0][1] = Rain_green; col[0][2] = Rain_blue;
      Fnum[0] = rain_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Cloudy_red; col[2][1] = Cloudy_green; col[2][2] = Cloudy_blue;
      Fnum[2] = cloudy_fnt_num;
      break;
    
    //--------雨時々雪-----------------
    case 303:
    case 309:
    case 322:
      //Serial.println("雨時々雪");
      col[0][0] =  Rain_red; col[0][1] = Rain_green; col[0][2] = Rain_blue;
      Fnum[0] = rain_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Snow_red; col[2][1] = Snow_green; col[2][2] = Snow_blue;
      Fnum[2] = snow_fnt_num;
      break;
    
    //--------暴風雨-----------------
    case 308:
      //Serial.println("暴風雨");
      Fnum[0] = 0;
      col[1][0] =  Rain_red; col[1][1] = Rain_green; col[1][2] = Rain_blue;
      Fnum[1] = storm_fnt_num; //縦棒、または矢印
      Fnum[2] = 0;
      break;
    
    //--------雨後晴れ-----------------
    case 311:
    case 316:
    case 320:
    case 323:
    case 324:
    case 325:
      //Serial.println("雨後晴れ");
      col[0][0] = Rain_red; col[0][1] = Rain_green; col[0][2] = Rain_blue;
      Fnum[0] = rain_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Sunny_red; col[2][1] = Sunny_green; col[2][2] = Sunny_blue;
      Fnum[2] = sunny_fnt_num;
      break;

    //--------雨後曇り-----------------
    case 313:
    case 317:
    case 321:
      //Serial.println("雨後曇り");
      col[0][0] = Rain_red; col[0][1] = Rain_green; col[0][2] = Rain_blue;
      Fnum[0] = rain_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Cloudy_red; col[2][1] = Cloudy_green; col[2][2] = Cloudy_blue;
      Fnum[2] = cloudy_fnt_num;
      break;

    //--------雨後雪-----------------
    case 314:
    case 315:
    case 326:
    case 327:
      //Serial.println("雨後雪");
      col[0][0] = Rain_red; col[0][1] = Rain_green; col[0][2] = Rain_blue;
      Fnum[0] = rain_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Snow_red; col[2][1] = Snow_green; col[2][2] = Snow_blue;
      Fnum[2] = snow_fnt_num;
      break;
    
    //--------雪-----------------
    case 340:
    case 400:
    case 405:
    case 425:
    case 426:
    case 427:
    case 450:
      //Serial.println("雪");
      Fnum[0] = 0;
      col[1][0] =  Snow_red; col[1][1] = Snow_green; col[1][2] = Snow_blue;
      Fnum[1] = storm_fnt_num; //縦棒、または矢印
      Fnum[2] = 0;
      break;
    
    //--------雪時々晴れ-----------------
    case 401:
      //Serial.println("雪時々晴れ");
      col[0][0] =  Snow_red; col[0][1] = Snow_green; col[0][2] = Snow_blue;
      Fnum[0] = snow_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Sunny_red; col[2][1] = Sunny_green; col[2][2] = Sunny_blue;
      Fnum[2] = sunny_fnt_num;
      break;
    
    //--------雪時々曇り-----------------
    case 402:
      //Serial.println("雪時々曇り");
      col[0][0] =  Snow_red; col[0][1] = Snow_green; col[0][2] = Snow_blue;
      Fnum[0] = snow_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Cloudy_red; col[2][1] = Cloudy_green; col[2][2] = Cloudy_blue;
      Fnum[2] = sunny_fnt_num;
      break;
    
