mgo-tec/ESP32_SD_SSD1331_Gadgets/src/ESP32_SD_SSD1331_Gadgets.cpp
    //--------雪時々雨-----------------
    case 403:
    case 409:
      //Serial.println("雪時々雨");
      col[0][0] =  Snow_red; col[0][1] = Snow_green; col[0][2] = Snow_blue;
      Fnum[0] = snow_fnt_num;
      Fnum[1] = 27; //[時々（一時）]縦棒
      col[2][0] =  Rain_red; col[2][1] = Rain_green; col[2][2] = Rain_blue;
      Fnum[2] = rain_fnt_num;
      break;
    
    //--------暴風雪-----------------
    //暴風雪アイコンはまだ無い
    case 406:
    case 407:
      //Serial.println("暴風雪");
      Fnum[0] = 0;
      col[1][0] =  Snow_red; col[1][1] = Snow_green; col[1][2] = Snow_blue;
      Fnum[1] = storm_fnt_num; //縦棒、または矢印
      Fnum[2] = 0;
      break;
    
    //--------雪後晴れ-----------------
    case 361:
    case 411:
    case 420:
      //Serial.println("雪後晴れ");
      col[0][0] =  Snow_red; col[0][1] = Snow_green; col[0][2] = Snow_blue;
      Fnum[0] = snow_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Sunny_red; col[2][1] = Sunny_green; col[2][2] = Sunny_blue;
      Fnum[2] = sunny_fnt_num;
      break;
    
    //--------雪後曇り-----------------
    case 371:
    case 413:
    case 421:
      //Serial.println("雪後曇り");
      col[0][0] =  Snow_red; col[0][1] = Snow_green; col[0][2] = Snow_blue;
      Fnum[0] = snow_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Cloudy_red; col[2][1] = Cloudy_green; col[2][2] = Cloudy_blue;
      Fnum[2] = cloudy_fnt_num;
      break;

    //--------雪後雨-----------------
    case 414:
    case 422:
    case 423:
      //Serial.println("雪後雨");
      col[0][0] =  Snow_red; col[0][1] = Snow_green; col[0][2] = Snow_blue;
      Fnum[0] = snow_fnt_num;
      Fnum[1] = 28; //[のち]矢印
      col[2][0] =  Rain_red; col[2][1] = Rain_green; col[2][2] = Rain_blue;
      Fnum[2] = rain_fnt_num;
      break;

    default:
      break;
  }
 }